---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalSetting.GetElectricalSettings(Autodesk.Revit.DB.Document)
source: html/302abeae-4875-bb5d-db5d-d6e6cfa8afb8.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSetting.GetElectricalSettings Method

Get the electrical settings of the project.

## Syntax (C#)
```csharp
public static ElectricalSetting GetElectricalSettings(
	Document document
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The electrical settings of the project.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null